tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "stripe/stripe-cli"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "autoconf"
brew "automake"
brew "gmp"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "asdf"
brew "atuin"
brew "bat"
brew "bison"
brew "black"
brew "bottom"
brew "cmake"
brew "ctop"
brew "curl"
brew "duf"
brew "elixir"
brew "eza"
brew "fd"
brew "openjpeg"
brew "ffmpeg"
brew "flex"
brew "fzf"
brew "gcc"
brew "gnupg"
brew "gdal"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-prolog"
brew "httpie"
brew "jrnl"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "mas"
brew "mypy"
brew "ncurses"
brew "tree-sitter"
brew "neovim"
brew "ocrmypdf"
brew "pandoc"
brew "pdfgrep"
brew "postgresql@16"
brew "powerlevel10k"
brew "prettier"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "speedtest-cli"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tree"
brew "unzip"
brew "vim"
brew "wget"
brew "zoxide"
brew "zsh"
brew "stripe/stripe-cli/stripe"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "anki"
cask "backblaze"
cask "bettermouse"
cask "cleanmymac"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "exodus"
cask "firefox"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "github"
cask "google-chrome"
cask "hazel"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keyboardcleantool"
cask "mactex"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "mission-control-plus"
cask "monitorcontrol"
cask "monodraw"
cask "moom"
cask "numi"
cask "obsidian"
cask "pdfpen"
cask "plex-media-server"
cask "plexamp"
cask "postman"
cask "raspberry-pi-imager"
cask "selfcontrol"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "soundsource"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "Amphetamine", id: 937984704
mas "Dato", id: 1470584107
mas "Drafts", id: 1435957248
mas "Hand Mirror", id: 1502839586
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "Kindle", id: 302584613
mas "Mela", id: 1568924476
mas "Numbers", id: 409203825
mas "Reeder", id: 1529448980
mas "StopTheMadness", id: 1376402589
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "htmlhint.vscode-htmlhint"
vscode "james-yu.latex-workshop"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-australian-english"
vscode "svelte.svelte-vscode"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
